backend/app/services/create_new_articles.rb

INSERT INTO "articles" ("author", "title", "description", "url", "url_to_image", "published_at", "content", "source", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def insert_new_articles
    new_articles = MakeRequestData.new(
      query: @query,
      sort_by: @sort_by,
      from: @from
    ).call

    puts "*"*50
    puts new_articles

    ::Article.create(new_articles)